#  Analiza Danych w Pythonie: `pandas`

### 10 grudnia 2022

### `pandas`
Biblioteka `pandas` jest podstawowym narzędziem w ekosystemie Pythona do analizy danych:
 * dostarcza dwa podstawowe typy danych: 
   * `Series` (szereg, 1D)
   * `DataFrame` (ramka danych, 2D)
 * operacje na tych obiektach: obsługa brakujących wartości, łączenie danych;
 * obsługuje dane różnego typu, np. szeregi czasowe;
 * biblioteka bazuje na `numpy` -- bibliotece do obliczeń numerycznych;
 * pozwala też na prostą wizualizację danych;
 * ETL: extract, transform, load.

Żeby zaimportowąc bibliotekę `pandas` wystarczy:

In [1]:
import pandas as pd

#### __Zadanie 0__: sprawdź, czy masz zainstalowaną bibliotekę `pandas`.

In [2]:
pip list

Package                       Version
----------------------------- --------------------
alabaster                     0.7.12
anaconda-client               1.11.0
anaconda-navigator            2.3.2
anaconda-project              0.11.1
anyio                         3.5.0
appdirs                       1.4.4
argon2-cffi                   21.3.0
argon2-cffi-bindings          21.2.0
arrow                         1.2.2
astroid                       2.11.7
astropy                       5.1
atomicwrites                  1.4.0
attrs                         21.4.0
Automat                       20.2.0
autopep8                      1.6.0
Babel                         2.9.1
backcall                      0.2.0
backports.functools-lru-cache 1.6.4
backports.tempfile            1.0
backports.weakref             1.0.post1
bcrypt                        3.2.0
beautifulsoup4                4.11.1
binaryornot                   0.4.4
bitarray                      2.5.1
bkcharts                      0.2
black                         22.6.0
bleach                        4.1.0
bokeh                         2.4.3
boto3                         1.24.28
botocore                      1.27.28
Bottleneck                    1.3.5
brotlipy                      0.7.0
certifi                       2022.9.14
cffi                          1.15.1
chardet                       4.0.0
charset-normalizer            2.0.4
click                         8.0.4
cloudpickle                   2.0.0
clyent                        1.2.2
colorama                      0.4.5
colorcet                      3.0.0
comtypes                      1.1.10
conda                         22.9.0
conda-build                   3.22.0
conda-content-trust           0.1.3
conda-pack                    0.6.0
conda-package-handling        1.9.0
conda-repo-cli                1.0.20
conda-token                   0.4.0
conda-verify                  3.4.2
constantly                    15.1.0
cookiecutter                  1.7.3
coverage                      6.5.0
cryptography                  37.0.1
cssselect                     1.1.0
cycler                        0.11.0
Cython                        0.29.32
cytoolz                       0.11.0
daal4py                       2021.6.0
dask                          2022.7.0
datashader                    0.14.1
datashape                     0.5.4
debugpy                       1.5.1
decorator                     5.1.1
defusedxml                    0.7.1
diff-match-patch              20200713
dill                          0.3.4
distributed                   2022.7.0
docutils                      0.18.1
entrypoints                   0.4
et-xmlfile                    1.1.0
fastjsonschema                2.16.2
filelock                      3.6.0
flake8                        4.0.1
Flask                         1.1.2
fonttools                     4.25.0
fsspec                        2022.7.1
future                        0.18.2
gensim                        4.1.2
glob2                         0.7
greenlet                      1.1.1
h5py                          3.7.0
HeapDict                      1.0.1
holoviews                     1.15.0
hvplot                        0.8.0
hyperlink                     21.0.0
idna                          3.3
imagecodecs                   2021.8.26
imageio                       2.19.3
imagesize                     1.4.1
importlib-metadata            4.11.3
incremental                   21.3.0
inflection                    0.5.1
iniconfig                     1.1.1
intake                        0.6.5
intervaltree                  3.1.0
ipykernel                     6.15.2
ipython                       7.31.1
ipython-genutils              0.2.0
ipywidgets                    7.6.5
isort                         5.9.3
itemadapter                   0.3.0
itemloaders                   1.0.4
itsdangerous                  2.0.1
jdcal                         1.4.1
jedi                          0.18.1
jellyfish                     0.9.0
Jinja2                        2.11.3
jinja2-time                   0.2.0
jmespath                      0.10.0
joblib                        1.1.0
json5                         0.9.6
jsonschema                    4.16.0
jupyter                       1.0.0
jupyter_client                7.3.4
jupyter-console               6.4.3
jupyter_core                  4.11.1
jupyter-server                1.18.1
jupyterlab                    3.4.4
jupyterlab-pygments           0.1.2
jupyterlab-server             2.10.3
jupyterlab-widgets            1.0.0
keyring                       23.4.0
kiwisolver                    1.4.2
lazy-object-proxy             1.6.0
libarchive-c                  2.9
llvmlite                      0.38.0
locket                        1.0.0
lxml                          4.9.1
lz4                           3.1.3
Markdown                      3.3.4
MarkupSafe                    2.0.1
matplotlib                    3.5.2
matplotlib-inline             0.1.6
mccabe                        0.6.1
menuinst                      1.4.19
mistune                       0.8.4
mkl-fft                       1.3.1
mkl-random                    1.2.2
mkl-service                   2.4.0
mock                          4.0.3
mpmath                        1.2.1
msgpack                       1.0.3
multipledispatch              0.6.0
munkres                       1.1.4
mypy-extensions               0.4.3
navigator-updater             0.3.0
nbclassic                     0.3.5
nbclient                      0.5.13
nbconvert                     6.4.4
nbformat                      5.5.0
nest-asyncio                  1.5.5
networkx                      2.8.4
nltk                          3.7
nose                          1.3.7
notebook                      6.4.12
numba                         0.55.1
numexpr                       2.8.3
numpy                         1.21.5
numpydoc                      1.4.0
olefile                       0.46
openpyxl                      3.0.10
packaging                     21.3
pandas                        1.4.4
pandocfilters                 1.5.0
panel                         0.13.1
param                         1.12.0
paramiko                      2.8.1
parsel                        1.6.0
parso                         0.8.3
partd                         1.2.0
pathlib                       1.0.1
pathspec                      0.9.0
patsy                         0.5.2
pep8                          1.7.1
pexpect                       4.8.0
pickleshare                   0.7.5
Pillow                        9.2.0
pip                           22.2.2
pkginfo                       1.8.2
platformdirs                  2.5.2
plotly                        5.9.0
pluggy                        1.0.0
poyo                          0.5.0
pprintpp                      0.4.0
prometheus-client             0.14.1
prompt-toolkit                3.0.20
Protego                       0.1.16
psutil                        5.9.0
ptyprocess                    0.7.0
py                            1.11.0
pyasn1                        0.4.8
pyasn1-modules                0.2.8
pycodestyle                   2.8.0
pycosat                       0.6.3
pycountry                     22.3.5
pycountry-convert             0.7.2
pycparser                     2.21
pyct                          0.4.8
pycurl                        7.45.1
PyDispatcher                  2.0.5
pydocstyle                    6.1.1
pyerfa                        2.0.0
pyflakes                      2.4.0
Pygments                      2.11.2
PyHamcrest                    2.0.2
PyJWT                         2.4.0
pylint                        2.14.5
pyls-spyder                   0.4.0
PyNaCl                        1.5.0
pyodbc                        4.0.34
pyOpenSSL                     22.0.0
pyparsing                     3.0.9
pyrsistent                    0.18.0
PySocks                       1.7.1
pytest                        7.1.2
pytest-cov                    4.0.0
pytest-mock                   3.10.0
python-dateutil               2.8.2
python-lsp-black              1.0.0
python-lsp-jsonrpc            1.0.0
python-lsp-server             1.3.3
python-slugify                5.0.2
python-snappy                 0.6.0
pytz                          2022.1
pyviz-comms                   2.0.2
PyWavelets                    1.3.0
pywin32                       302
pywin32-ctypes                0.2.0
pywinpty                      2.0.2
PyYAML                        6.0
pyzmq                         23.2.0
QDarkStyle                    3.0.2
qstylizer                     0.1.10
QtAwesome                     1.0.3
qtconsole                     5.2.2
QtPy                          2.2.0
queuelib                      1.5.0
regex                         2022.7.9
repoze.lru                    0.7
requests                      2.28.1
requests-file                 1.5.1
rope                          0.22.0
Rtree                         0.9.7
ruamel-yaml-conda             0.15.100
s3transfer                    0.6.0
scikit-image                  0.19.2
scikit-learn                  1.0.2
scikit-learn-intelex          2021.20221004.171935
scipy                         1.9.1
Scrapy                        2.6.2
seaborn                       0.11.2
Send2Trash                    1.8.0
service-identity              18.1.0
setuptools                    63.4.1
sip                           4.19.13
six                           1.16.0
smart-open                    5.2.1
sniffio                       1.2.0
snowballstemmer               2.2.0
sortedcollections             2.1.0
sortedcontainers              2.4.0
soupsieve                     2.3.1
Sphinx                        5.0.2
sphinxcontrib-applehelp       1.0.2
sphinxcontrib-devhelp         1.0.2
sphinxcontrib-htmlhelp        2.0.0
sphinxcontrib-jsmath          1.0.1
sphinxcontrib-qthelp          1.0.3
sphinxcontrib-serializinghtml 1.1.5
spyder                        5.2.2
spyder-kernels                2.2.1
SQLAlchemy                    1.4.39
statsmodels                   0.13.2
sympy                         1.10.1
tables                        3.6.1
tabulate                      0.8.10
TBB                           0.2
tblib                         1.7.0
tenacity                      8.0.1
terminado                     0.13.1
testpath                      0.6.0
text-unidecode                1.3
textdistance                  4.2.1
threadpoolctl                 2.2.0
three-merge                   0.1.1
tifffile                      2021.7.2
tinycss                       0.4
tldextract                    3.2.0
toml                          0.10.2
tomli                         2.0.1
tomlkit                       0.11.1
toolz                         0.11.2
tornado                       6.1
tqdm                          4.64.1
traitlets                     5.1.1
Twisted                       22.2.0
twisted-iocpsupport           1.0.2
typing_extensions             4.3.0
ujson                         5.4.0
Unidecode                     1.2.0
urllib3                       1.26.11
w3lib                         1.21.0
watchdog                      2.1.6
wcwidth                       0.2.5
webencodings                  0.5.1
websocket-client              0.58.0
Werkzeug                      2.0.3
wheel                         0.37.1
widgetsnbextension            3.5.2
win-inet-pton                 1.1.0
win-unicode-console           0.5
wincertstore                  0.2
wrapt                         1.14.1
xarray                        0.20.1
xlrd                          2.0.1
XlsxWriter                    3.0.3
xlwings                       0.27.15
yapf                          0.31.0
zict                          2.1.0
zipp                          3.8.0
zope.interface                5.4.0
Note: you may need to restart the kernel to use updated packages.

### [Szeregi](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html) (`pd.Series`)

 Szereg reprezentuje jednorodne dane jednowymiarowe - jest odpowiednikiem wektora w R.
  * Szeregi możemy tworzyć na różne sposoby (więcej za chwilę), np. z obiektów tj. listy i słowniki.
  * Dane muszą być jednorodne. W przeciwnym przypadku nastąpi automatyczna konwersja.
  * Podczas tworzenia szeregu musimy podać jeden obowiązkowy argument `data` - dane.
  * Ponadto możemy podać też indeks (`index`), typ danych (`dtype`) lub nazwę (`name`).
  
  
  ```
  class pandas.Series(data=None, index=None, dtype=None, name=None)
  ```

Podczas tworzenie szeregu mozemy podać dane w formacie listy lub słownika.

Poniżej jest przykład przedstawiający tworzenie szeregu z danych, które są zawarte w liście:

In [3]:
data = [211819, 682758, 737011, 779511, 673790, 673790, 444177, 136791]

s = pd.Series(data)

s

0    211819
1    682758
2    737011
3    779511
4    673790
5    673790
6    444177
7    136791
dtype: int64

In [4]:
s[2]

737011

W przypadku, gdy dane pochodzą z listy i nie podaliśmy indeksu, pandas doda automatyczny indeks liczbowy zaczynający się od 0.

W przypadku przekazania słownika jako danych do szeregu, pandas wykorzysta klucze do stworzenia indeksu:

In [5]:
members = {'April': 211819,'May': 682758, 'June': 737011, 'July': 779511}

s = pd.Series(members)

s

April    211819
May      682758
June     737011
July     779511
dtype: int64

In [6]:
s['April']

211819

Podczas tworzenia szeregu możemy zdefiniować indeks, jak i nazwę szeregu:

In [7]:
months = ['April', 'May', 'June', 'July']

data = [211819, 682758, 737011, 779511]

s = pd.Series(data=data, index=months, dtype=float, name='Rides')

s

April    211819.0
May      682758.0
June     737011.0
July     779511.0
Name: Rides, dtype: float64

Odwołanie się do poszczególnego elementu odbywa się przy pomocy klucza z indeksu.

In [8]:
members = {'April': 211819,'May': 682758, 'June': 737011, 'July': 779511}

s = pd.Series(members)

print(s['April'])

s['August'] = 673790
s

211819

April     211819
May       682758
June      737011
July      779511
August    673790
dtype: int64

Dodanie elementu do szeregu odbywa się poprzez definiowanie nowego klucza:

In [9]:
members = {'April': 211819,'May': 682758, 'June': 737011, 'July': 779511}

s = pd.Series(members)

s['August'] = 673790

s

April     211819
May       682758
June      737011
July      779511
August    673790
dtype: int64

Więcej nt. indeksowania w szeregach w dalszej części kursu.

Podstawowa cechą szeregu jest wykonywanie operacji w sposób wektorowy. Działa to w następujący sposób:
 * gdy w obu szeregach jest zawarty ten sam klucz, to są sumowane ich wartości;
 * w przeciwnym przypadku wartość klucza w wynikowym szeregu to `pd.NaN`.  
 * Równoważnie możemy wykorzystać metodę `pandas.Series.add`. W tym przypadku możemy podać domyślną wartość w przypadku braku klucza.

In [12]:
members = pd.Series({'May': 682758, 'June': 737011,  'August': 673790, 'July': 779511,
'September': 673790, 'October': 444177})

occasionals = pd.Series({'May': 147898, 'June': 171494, 'July': 194316, 'August': 206809,
'September': 140492})

all_data = members + occasionals
all_data

August       880599.0
July         973827.0
June         908505.0
May          830656.0
October           NaN
September    814282.0
dtype: float64

In [14]:
# Równoważnie, fill_value zastępuje NaN
all_data = members.add(occasionals, fill_value = 0)
all_data

August       880599.0
July         973827.0
June         908505.0
May          830656.0
October      444177.0
September    814282.0
dtype: float64

Możemy wykonać operacje arytmetyczne na szeregu:

In [15]:
members = pd.Series({'May': 682758, 'June': 737011, 'July': 779511, 'August': 673790,
'September': 673790, 'October': 444177})

In [17]:
members += 1000000000

members

May          1000683758
June         1000738011
July         1000780511
August       1000674790
September    1000674790
October      1000445177
dtype: int64

### Podsumowanie
 * Szeregi działają podobnie do słowników, z tą różnicą, że wartości muszą być jednorodne (tego samego typu).
 * Odwołanie do poszczególnych elementów odbywa się poprzez nawiasy `[]` i podanie klucza.
 * W przeciwieństwie do słowników, możemy w prosty sposób wykonywać operacje arytmetyczne.

### Zadanie 1
 * Stwórz szereg `n`, który będzie zawierać liczby od 0 do 10 (włącznie).
 * Stwórz szereg `n2`, który będzie zawierać kwadraty liczb od 0 do 10 (włącznie).
 * Następnie stwórz szereg `trojkatne`, który będzie sumą powyższych szeregów podzieloną przez 2.

In [18]:
n1 = pd.Series(x for x in range(0,11))
n2 = pd.Series(range(11))

In [19]:
n1

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [20]:
n2

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [22]:
n3 = n1 ** 2
n3

0       0
1       1
2       4
3       9
4      16
5      25
6      36
7      49
8      64
9      81
10    100
dtype: int64

In [23]:
trojkatne = (n2 + n3) / 2
trojkatne

0      0.0
1      1.0
2      3.0
3      6.0
4     10.0
5     15.0
6     21.0
7     28.0
8     36.0
9     45.0
10    55.0
dtype: float64

### [Ramka danych](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) (`pd.DataFrame`)

Ramka danych jest podstawową strukturą danych w bibliotece `pandas`, która pozwala na trzymanie i reprezentowanie danych tabelarycznych (dwuwymiarowych).
 * Posiada kolumny (cechy) i wiersze (obserwacje, przykłady).
 * Możemy też patrzeć na nią jak na słownik, którego wartościami są szeregi.

```
class pandas.DataFrame(data=None, index=None, columns=None, dtype=None)
```

Ramkę danych możemy stworzyć na różne sposoby.

Pierwszy z nich ("kolumnowy") polega na zdefiniowaniu ramki poprzez podanie szeregów jako kolumn:

In [24]:
members = pd.Series({'May': 682758, 'June': 737011, 'July': 779511})
occasionals = pd.Series({'May': 147898, 'June': 171494, 'July': 194316})

df = pd.DataFrame({'members': members, 'occasionals': occasionals})
df

      members  occasionals
May    682758       147898
June   737011       171494
July   779511       194316

In [25]:
print(df)

      members  occasionals
May    682758       147898
June   737011       171494
July   779511       194316

Drugim popularnym sposobem jest przekazanie listy słowników. Wtedy `pandas` zinterpretuje to jako listę przykładów:

In [26]:
data = [
    {'members': 682758, 'occasionals': 147898},
    {'occasionals': 171494,'members': 737011},
    {'members': 779511, 'occasionals': 194316},
]

df = pd.DataFrame(data)

df

   members  occasionals
0   682758       147898
1   737011       171494
2   779511       194316

Możemy też wykorzystać metodę `from_dict` ([doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.from_dict.html)), która pozwala zdefiniować czy podane dane są w podane w postaci kolumnowej lub wierszowej:

In [27]:
data = {
    'May': {'members': 682758, 'occasionals': 147898},
    'June': {'members': 737011, 'occasionals': 171494},
    'July': {'members': 779511, 'occasionals': 194316}
}

df = pd.DataFrame.from_dict(data, orient='index')
print('index\n', df)
print()
df = pd.DataFrame.from_dict(data, orient='columns')
print('columns\n', df)

index
       members  occasionals
May    682758       147898
June   737011       171494
July   779511       194316

columns
                 May    June    July
members      682758  737011  779511
occasionals  147898  171494  194316

### Wczytywanie danych

Biblioteka `pandas` pozwala na wczytanie i zapis danych z różnych formatów:
 * formaty tekstowe, np. `csv`, `json`
 * pliki arkuszy kalkulacyjnych: Excel (xls, xlsx)
 * bazy danych
 * inne: `sas` `spss`


Efektem wczytania danych jest odpowiednio stworzona ramka danych (`DataFrame`).

Jednym z najprostszych formatów danych jest format `csv`, gdzie kolejne wartości są rozdzielone przecinkiem.

Żeby wczytać dane w takim formacie należy użyć funkcji `pandas.read_csv`.

Pandas pozwala na ustawienie wielu parametrów (np. separator, cudzysłowy). Więcej na ten temat w [dokumentacji](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html).

In [28]:
df = pd.read_csv('gapminder.csv')

df

,Country,female_BMI,male_BMI,gdp,population,under5mortality,life_expectancy,fertility
0,Afghanistan,21.07402,20.62058,1311.0,26528741.0,110.4,52.8,6.20
1,Albania,25.65726,26.44657,8644.0,2968026.0,17.9,76.8,1.76
2,Algeria,26.36841,24.59620,12314.0,34811059.0,29.5,75.5,2.73
3,Angola,23.48431,22.25083,7103.0,19842251.0,192.0,56.7,6.43
4,Antigua and Barbuda,27.50545,25.76602,25736.0,85350.0,10.9,75.5,2.16
...,...,...,...,...,...,...,...,...
170,Venezuela,28.13408,27.44500,17911.0,28116716.0,17.1,74.2,2.53
171,Vietnam,21.06500,20.91630,4085.0,86589342.0,26.2,74.1,1.86
172,Palestine,29.02643,26.57750,3564.0,3854667.0,24.7,74.1,4.38
173,Zambia,23.05436,20.68321,3039.0,13114579.0,94.9,51.1,5.88
174,Zimbabwe,24.64522,22.02660,1286.0,13495462.0,98.3,47.3,3.85

In [29]:
df = pd.read_csv('./titanic_train.tsv', delimiter='\t', index_col=0, nrows=5)
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,Braund\t Mr. Owen Harris,male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,Heikkinen\t Miss. Laina,female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35,1,0,113803,53.1000,C123,S
5,0,3,Allen\t Mr. William Henry,male,35,0,0,373450,8.0500,NaN,S

Do wczytania danych z arkusza kalkulacyjnego służy funkcja `pandas.read_excel`. Do otworzenia pliku `xlsx` może być koniecnze ustawienie parametru: `engine='openpyxl`. Więcej opcji w [dokumentacji](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html).

In [30]:
# df = pd.read_excel('./bikes.xlsx', engine='openpyxl', nrows=5)
# Działa bez "engine":
df = pd.read_excel('./bikes.xlsx', nrows=5)
df

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member
0,2019-04-14 07:55:22,6001,2019-04-14 08:07:16,6132,713,1
1,2019-04-14 07:59:31,6411,2019-04-14 08:09:18,6411,587,1
2,2019-04-14 07:59:55,6097,2019-04-14 08:12:11,6036,736,1
3,2019-04-14 07:59:57,6310,2019-04-14 08:27:58,6345,1680,1
4,2019-04-14 08:00:37,7029,2019-04-14 08:14:12,6250,814,0

Innym ważnym źródłem informacji są bazy danych. Pandas potrafi komunikować się z bazą danych za pomocą biblioteki [SQLAlchemy](https://pypi.org/project/SQLAlchemy/) i dostarcza odpowiedną funkcję:
 * `pandas.read_sql` - wczytanie całej tabeli lub zapytania do bazy danych

In [34]:
df = pd.read_sql('Album', con='sqlite:///Chinook.sqlite', index_col='AlbumId')

df

                                                     Title  ArtistId
AlbumId
1                    For Those About To Rock We Salute You         1
2                                        Balls to the Wall         2
3                                        Restless and Wild         2
4                                        Let There Be Rock         1
5                                                 Big Ones         3
...                                                    ...       ...
343                                 Respighi:Pines of Rome       226
344      Schubert: The Late String Quartets & String Qu...       272
345                                    Monteverdi: L'Orfeo       273
346                                  Mozart: Chamber Music       274
347      Koyaanisqatsi (Soundtrack from the Motion Pict...       275

[347 rows x 2 columns]

In [35]:
import sqlalchemy

engine = sqlalchemy.create_engine('sqlite:///Chinook.sqlite', echo=True)
connection  = engine.raw_connection()

df = pd.read_sql('SELECT * FROM Album', con=connection, index_col='AlbumId')
df

C:\Users\User\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                                                     Title  ArtistId
AlbumId
1                    For Those About To Rock We Salute You         1
2                                        Balls to the Wall         2
3                                        Restless and Wild         2
4                                        Let There Be Rock         1
5                                                 Big Ones         3
...                                                    ...       ...
343                                 Respighi:Pines of Rome       226
344      Schubert: The Late String Quartets & String Qu...       272
345                                    Monteverdi: L'Orfeo       273
346                                  Mozart: Chamber Music       274
347      Koyaanisqatsi (Soundtrack from the Motion Pict...       275

[347 rows x 2 columns]

Biblioteka `pandas` potrafi także automatycznie pobrać dane, które znajdują się w Internecie. Dzięki temu możemy zaciągnąć dane z Google spreadsheets:

In [36]:
url = "https://docs.google.com/spreadsheets/d/1ycvVWmVJ2MTn3_1NRVmVrySoHEHdWlwi4-Kr1W0Nv28/export?format=csv&gid=848662053"
df = pd.read_csv(url)

df

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.0,0.27,0.36,20.7,0.045,45,170,1.0010,3.00,0.45,8.8,6
1,6.3,0.30,0.34,1.6,0.049,14,132,0.9940,3.30,0.49,9.5,6
2,8.1,0.28,0.40,6.9,0.050,30,97,0.9951,3.26,0.44,10.1,6
3,7.2,0.23,0.32,8.5,0.058,47,186,0.9956,3.19,0.40,9.9,6
4,7.2,0.23,0.32,8.5,0.058,47,186,0.9956,3.19,0.40,9.9,6
5,8.1,0.28,0.40,6.9,0.050,30,97,0.9951,3.26,0.44,10.1,6
6,6.2,0.32,0.16,7.0,0.045,30,136,0.9949,3.18,0.47,9.6,6
7,7.0,0.27,0.36,20.7,0.045,45,170,1.0010,3.00,0.45,8.8,6

#### Podsumowanie


 * Biblioteka `pandas` wspiera pobieranie danych z różnych formatów i źródeł.
 * Każda funkcja ma listę argumentów, które pozwalają na ustawić poszczególne  parametry (np. [read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html#pandas.read_csv)).

### Zapis i eksport danych

In [ ]:
Pandas pozwala w prosty sposób na zapisywanie ramki danych do pliku.

In [37]:
members = pd.Series({'May': 682758, 'June': 737011, 'July': 779511})
occasionals = pd.Series({'May': 147898, 'June': 171494, 'July': 194316})

df = pd.DataFrame({'members': members, 'occasionals': occasionals})

In [38]:
# zapis do formatu CSV
df.to_csv('tmp.csv')
# zapis do arkusza kalkulacyjnego 
df.to_excel('tmp.xlsx')

Ponadto możemy przekonwertować ramkę danych do JSONa lub Pythonowego słownika:

In [39]:
print(df.to_json())

{"members":{"May":682758,"June":737011,"July":779511},"occasionals":{"May":147898,"June":171494,"July":194316}}

In [40]:
print(df.to_dict())

{'members': {'May': 682758, 'June': 737011, 'July': 779511}, 'occasionals': {'May': 147898, 'June': 171494, 'July': 194316}}

Lub przekopiować dane do schowka:

In [41]:
df.to_clipboard()

### Zadanie

 * Przekonwertuj tabele `Customer` z bazy `Chinook.sqlite` do arkusza kalkulacyjnego. Plik wynikowy nazwij `customers.xlsx`.
 * Tabela `Employee` zawiera informacje o pracownikach firmy Chinook. Wyswietl dane na ekranie i podaj miasta, w których mieszkają pracownicy.
 * Tabela `Invoice` zawiera informacje o fakturach. Przekonwertuj kolumnę `BillingCountry` do pythonowego słownika, a następnie podaj najcześciej występującą wartość. Ile razy pojawiła się?

In [42]:
# 1
df = pd.read_sql('Customer', con='sqlite:///Chinook.sqlite', index_col = 'CustomerId')
df.to_excel('customers.xlsx')

In [43]:
# 2A
df = pd.read_sql('SELECT DISTINCT City FROM Employee', con='sqlite:///Chinook.sqlite')
df

         City
0    Edmonton
1     Calgary
2  Lethbridge

In [52]:
# 2B
df = pd.read_sql('Employee', con='sqlite:///Chinook.sqlite')
df['City'].unique()

array(['Edmonton', 'Calgary', 'Lethbridge'], dtype=object)

In [53]:
# 3A
# Create empty dictionary with countries:
df = pd.read_sql('Invoice', con='sqlite:///Chinook.sqlite')
data = df.to_dict()
countries = data['BillingCountry'].values()

from collections import Counter
Counter(countries).most_common(1)

[('USA', 91)]

In [57]:
# 3B
# Create empty dictionary with countries:
df2 = pd.read_sql('SELECT BillingCountry FROM Invoice', con='sqlite:///Chinook.sqlite')
df2['BillingCountry']

# Add counter to countries2 dict every time country appears in df:
for item in df2['BillingCountry']:
    if item in countries2.keys():
         countries2[item] +=1
            
# Call key with highest value assigned
max(countries2, key=countries2.get)

'USA'

In [58]:
# 3C - we can convert data to dictionary, convert it to df again and count rows
df2 = pd.read_sql('SELECT BillingCountry FROM Invoice', con='sqlite:///Chinook.sqlite')
df2_dict = df2['BillingCountry'].to_dict()

df2 = pd.Series(df2_dict)
#Count how many value appears in df, select top value (most common)
df2.value_counts().head(1)

USA    91
dtype: int64

### Ramka danych - podstawy

#### Kolumny

Na ramkę danych możemy patrzeć jak na swego rodzaju słownik, którego wartościami są szeregi. Pozwoli to na uzyskanie lepszej intuicji.

In [60]:
df = pd.read_csv('./gapminder.csv', index_col='Country', nrows=8, usecols=['Country', 'gdp', 'population','life_expectancy'])

df

                         gdp  population  life_expectancy
Country
Afghanistan           1311.0  26528741.0             52.8
Albania               8644.0   2968026.0             76.8
Algeria              12314.0  34811059.0             75.5
Angola                7103.0  19842251.0             56.7
Antigua and Barbuda  25736.0     85350.0             75.5
Argentina            14646.0  40381860.0             75.4
Armenia               7383.0   2975029.0             72.3
Australia            41312.0  21370348.0             81.6

Dostęp do poszczególnej kolumny możemy uzystać na dwa sposoby:

In [61]:
# notacja z kropką
df.population

Country
Afghanistan            26528741.0
Albania                 2968026.0
Algeria                34811059.0
Angola                 19842251.0
Antigua and Barbuda       85350.0
Argentina              40381860.0
Armenia                 2975029.0
Australia              21370348.0
Name: population, dtype: float64

In [62]:
# Operator []
df['population']

Country
Afghanistan            26528741.0
Albania                 2968026.0
Algeria                34811059.0
Angola                 19842251.0
Antigua and Barbuda       85350.0
Argentina              40381860.0
Armenia                 2975029.0
Australia              21370348.0
Name: population, dtype: float64

Do operatora `[]` możemy też podać listę nazw kolumn:

In [63]:
df[['gdp','population']]

                         gdp  population
Country
Afghanistan           1311.0  26528741.0
Albania               8644.0   2968026.0
Algeria              12314.0  34811059.0
Angola                7103.0  19842251.0
Antigua and Barbuda  25736.0     85350.0
Argentina            14646.0  40381860.0
Armenia               7383.0   2975029.0
Australia            41312.0  21370348.0

Listę kolumn możemy pobrać za pomocą:

In [64]:
df.columns

Index(['gdp', 'population', 'life_expectancy'], dtype='object')

In [65]:
df.columns = ['PKB', 'Populacja', 'ODŻ']

df

                         PKB   Populacja   ODŻ
Country
Afghanistan           1311.0  26528741.0  52.8
Albania               8644.0   2968026.0  76.8
Algeria              12314.0  34811059.0  75.5
Angola                7103.0  19842251.0  56.7
Antigua and Barbuda  25736.0     85350.0  75.5
Argentina            14646.0  40381860.0  75.4
Armenia               7383.0   2975029.0  72.3
Australia            41312.0  21370348.0  81.6

In [66]:
df.columns

Index(['PKB', 'Populacja', 'ODŻ'], dtype='object')

Żeby odwołać się do poszczególnych wierszy należy wykorzystać metodę `loc`:

In [67]:
df.loc['Argentina']

PKB             14646.0
Populacja    40381860.0
ODŻ                75.4
Name: Argentina, dtype: float64

Metoda `loc` również może przyjąć listę wierszy:

In [68]:
df.loc[['Albania', 'Angola']]

            PKB   Populacja   ODŻ
Country
Albania  8644.0   2968026.0  76.8
Angola   7103.0  19842251.0  56.7

Możemy również podać drugi parametr: nazwy kolumn:

In [69]:
df2 = df.loc[['Albania', 'Angola'], ['PKB', 'Populacja']]

df2

            PKB   Populacja
Country
Albania  8644.0   2968026.0
Angola   7103.0  19842251.0

Albo wykorzystać tzw. _slicing_, czyli operator `:`:

In [70]:
df.loc['Albania': 'Angola', 'PKB': 'ODŻ']

             PKB   Populacja   ODŻ
Country
Albania   8644.0   2968026.0  76.8
Algeria  12314.0  34811059.0  75.5
Angola    7103.0  19842251.0  56.7

Żeby odwołać się do pojedyńczej wartości możemy użyć metody `at`:

In [71]:
df.at['Angola', 'PKB']

7103.0

Dostęp do indeksu:

In [72]:
df.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Antigua and Barbuda',
       'Argentina', 'Armenia', 'Australia'],
      dtype='object', name='Country')

#### Podstawowe metody `pd.Series` i `pd.DataFrame`

In [73]:
members = pd.Series({'May': 682758, 'June': 737011, 'July': 779511, 'August': 673790,
'September': 673790, 'October': 444177})

occasionals = pd.Series({'May': 147898, 'June': 171494, 'July': 194316, 'August': 206809,
'September': 140492, 'October': 53596})

df = pd.DataFrame({'members': members, 'occasionals': occasionals})

df

           members  occasionals
May         682758       147898
June        737011       171494
July        779511       194316
August      673790       206809
September   673790       140492
October     444177        53596

Metoda `head` pozwala tworzy nową ramkę danych z pierwszymi 5 przykładami:

In [74]:
df.head()

           members  occasionals
May         682758       147898
June        737011       171494
July        779511       194316
August      673790       206809
September   673790       140492

Metoda `tail` robi to samo, ale z 5 ostatnymi przykładami:

In [75]:
df.tail()

           members  occasionals
June        737011       171494
July        779511       194316
August      673790       206809
September   673790       140492
October     444177        53596

In [76]:
df.tail(1)

         members  occasionals
October   444177        53596

Metoda `sample` pozwala na stworzenie nowej ramki danych z wylosowanymi `n` przykładami:

In [77]:
df.sample(3)

           members  occasionals
September   673790       140492
July        779511       194316
October     444177        53596

Metoda `describe` zwraca podstawowe statystyki m.in.: liczebność, średnią, wartości skrajne:

In [78]:
df.describe()

             members    occasionals
count       6.000000       6.000000
mean   665172.833333  152434.166667
std    116216.045456   54783.506738
min    444177.000000   53596.000000
25%    673790.000000  142343.500000
50%    678274.000000  159696.000000
75%    723447.750000  188610.500000
max    779511.000000  206809.000000

Metoda `info` zwraca informacje techniczne o kolumnach: np. typ danych:

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, May to October
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   members      6 non-null      int64
 1   occasionals  6 non-null      int64
dtypes: int64(2)
memory usage: 144.0+ bytes

Podstawową informacją o ramce danych to liczba przykładów w ramce danych. Możemy wykorzystać to tego funkcję `len`:

In [80]:
len(df)

6

Natomiast atrybut `shape` zwraca nam krotkę z liczbą przykładów i liczbą kolumn:

In [81]:
df.shape

(6, 2)

#### Operacja arytmetyczne

 * `max`, `idxmax`
 * `min`, `idxmin`
 * `mean`
 * `count`

In [82]:
df.mean()

members        665172.833333
occasionals    152434.166667
dtype: float64

In [83]:
df.max()

members        779511
occasionals    206809
dtype: int64

Zbiór wartości i zliczanie wartości:

In [84]:
dane = pd.Series([1, 3, 2, 3, 1, 1, 2, 3, 2, 3])

print(dane.unique())

print()

dane = pd.Series([1, 3, 2, 3, 1, 1, 2, 3, 2, 3])

print(dane.value_counts())

[1 3 2]

3    4
1    3
2    3
dtype: int64

Sprawdzanie czy brakuje danych:

In [85]:
df = pd.read_csv('./titanic_train.tsv', sep='\t', index_col='PassengerId')
df.Age

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     NaN
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

In [86]:
df.Age.isnull()

PassengerId
1      False
2      False
3      False
4      False
5      False
       ...
887    False
888    False
889     True
890    False
891    False
Name: Age, Length: 891, dtype: bool

In [88]:
#Ile nulli? 177
df.Age.isnull().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [87]:
df.Age.notnull()

PassengerId
1       True
2       True
3       True
4       True
5       True
       ...
887     True
888     True
889    False
890     True
891     True
Name: Age, Length: 891, dtype: bool

In [89]:
df.Age.notnull().value_counts()

True     714
False    177
Name: Age, dtype: int64

### Dodawanie i modyfikowanie danych

In [90]:
df = pd.read_csv('./gapminder.csv', index_col='Country', nrows=5)

df

,female_BMI,male_BMI,gdp,population,under5mortality,life_expectancy,fertility
Country,,,,,,,
Afghanistan,21.07402,20.62058,1311.0,26528741.0,110.4,52.8,6.20
Albania,25.65726,26.44657,8644.0,2968026.0,17.9,76.8,1.76
Algeria,26.36841,24.59620,12314.0,34811059.0,29.5,75.5,2.73
Angola,23.48431,22.25083,7103.0,19842251.0,192.0,56.7,6.43
Antigua and Barbuda,27.50545,25.76602,25736.0,85350.0,10.9,75.5,2.16

In [91]:
conts = pd.Series({
    'Afghanistan': 'Asia', 'Albania': 'Europe', 'Algeria':' Africa', 'Angola': 'Africa', 'Antigua and Barbuda': 'Americas'})

df['continent'] = conts

df['tmp'] = 1

df

,female_BMI,male_BMI,gdp,population,under5mortality,life_expectancy,fertility,continent,tmp
Country,,,,,,,,,
Afghanistan,21.07402,20.62058,1311.0,26528741.0,110.4,52.8,6.20,Asia,1
Albania,25.65726,26.44657,8644.0,2968026.0,17.9,76.8,1.76,Europe,1
Algeria,26.36841,24.59620,12314.0,34811059.0,29.5,75.5,2.73,Africa,1
Angola,23.48431,22.25083,7103.0,19842251.0,192.0,56.7,6.43,Africa,1
Antigua and Barbuda,27.50545,25.76602,25736.0,85350.0,10.9,75.5,2.16,Americas,1

In [92]:
df.loc['Argentina'] = {
    'female_BMI': 27.46523,
    'male_BMI': 27.5017,
    'gdp': 14646.0,
    'population': 40381860.0,
    'under5mortality': 15.4,
    'life_expectancy': 75.4,
    'fertility': 2.24
}
df

,female_BMI,male_BMI,gdp,population,under5mortality,life_expectancy,fertility,continent,tmp
Country,,,,,,,,,
Afghanistan,21.07402,20.62058,1311.0,26528741.0,110.4,52.8,6.20,Asia,1.0
Albania,25.65726,26.44657,8644.0,2968026.0,17.9,76.8,1.76,Europe,1.0
Algeria,26.36841,24.59620,12314.0,34811059.0,29.5,75.5,2.73,Africa,1.0
Angola,23.48431,22.25083,7103.0,19842251.0,192.0,56.7,6.43,Africa,1.0
Antigua and Barbuda,27.50545,25.76602,25736.0,85350.0,10.9,75.5,2.16,Americas,1.0
Argentina,27.46523,27.50170,14646.0,40381860.0,15.4,75.4,2.24,NaN,NaN

In [93]:
df.drop('gdp', axis='columns')

,female_BMI,male_BMI,population,under5mortality,life_expectancy,fertility,continent,tmp
Country,,,,,,,,
Afghanistan,21.07402,20.62058,26528741.0,110.4,52.8,6.20,Asia,1.0
Albania,25.65726,26.44657,2968026.0,17.9,76.8,1.76,Europe,1.0
Algeria,26.36841,24.59620,34811059.0,29.5,75.5,2.73,Africa,1.0
Angola,23.48431,22.25083,19842251.0,192.0,56.7,6.43,Africa,1.0
Antigua and Barbuda,27.50545,25.76602,85350.0,10.9,75.5,2.16,Americas,1.0
Argentina,27.46523,27.50170,40381860.0,15.4,75.4,2.24,NaN,NaN

### Filtrowanie danych

Biblioteka pandas posiada 2 sposoby na filtrowanie danych zawartych w ramce danych:
 * operator `[]` -- najbardziej rozpowszechniony;
 * metoda `query()`.
Oba sposoby mają różną składnię.

In [94]:
df = pd.read_csv('./titanic_train.tsv', sep='\t', index_col='PassengerId')

df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,Braund\t Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,Heikkinen\t Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
5,0,3,Allen\t Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [95]:
df['Survived']

PassengerId
1      0
2      1
3      1
4      1
5      0
      ..
887    0
888    1
889    0
890    1
891    0
Name: Survived, Length: 891, dtype: int64

In [96]:
df['Survived'] == 1

PassengerId
1      False
2       True
3       True
4       True
5      False
       ...
887    False
888     True
889    False
890     True
891    False
Name: Survived, Length: 891, dtype: bool

In [97]:
filtr = df['Survived'] == 1
df[filtr]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,Heikkinen\t Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
9,1,3,Johnson\t Mrs. Oscar W (Elisabeth Vilhelmina B...,female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,Nasser\t Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
876,1,3,"Najib\t Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
880,1,1,Potter\t Mrs. Thomas Jr (Lily Alexenia Wilson),female,56.0,0,1,11767,83.1583,C50,C
881,1,2,Shelley\t Mrs. William (Imanita Parrish Hall),female,25.0,0,1,230433,26.0000,NaN,S
888,1,1,Graham\t Miss. Margaret Edith,female,19.0,0,0,112053,30.0000,B42,S
890,1,1,Behr\t Mr. Karl Howell,male,26.0,0,0,111369,30.0000,C148,C

In [98]:
df[df['Pclass'] == 1]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
7,0,1,McCarthy\t Mr. Timothy J,male,54.0,0,0,17463,51.8625,E46,S
12,1,1,Bonnell\t Miss. Elizabeth,female,58.0,0,0,113783,26.5500,C103,S
24,1,1,Sloper\t Mr. William Thompson,male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...
872,1,1,Beckwith\t Mrs. Richard Leonard (Sallie Monypeny),female,47.0,1,1,11751,52.5542,D35,S
873,0,1,Carlsson\t Mr. Frans Olof,male,33.0,0,0,695,5.0000,B51 B53 B55,S
880,1,1,Potter\t Mrs. Thomas Jr (Lily Alexenia Wilson),female,56.0,0,1,11767,83.1583,C50,C
888,1,1,Graham\t Miss. Margaret Edith,female,19.0,0,0,112053,30.0000,B42,S
890,1,1,Behr\t Mr. Karl Howell,male,26.0,0,0,111369,30.0000,C148,C

#### Operatory

* `&` - koniukcja (i)
* `|` - alternatywa (lub)
* `~` - negacja (nie)
* `()` - jeżeli mamy kilka warunków to warto je uporządkować w nawiasy

In [99]:
pierwsza_klasa = df['Pclass'] == 1
kobiety = df['Sex'] == 'female'
query = (~pierwsza_klasa) & kobiety
df[query]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
3,1,3,Heikkinen\t Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
9,1,3,Johnson\t Mrs. Oscar W (Elisabeth Vilhelmina B...,female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,Nasser\t Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C
11,1,3,Sandstrom\t Miss. Marguerite Rut,female,4.0,1,1,PP 9549,16.7000,G6,S
15,0,3,Vestrom\t Miss. Hulda Amanda Adolfina,female,14.0,0,0,350406,7.8542,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
876,1,3,"Najib\t Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
881,1,2,Shelley\t Mrs. William (Imanita Parrish Hall),female,25.0,0,1,230433,26.0000,NaN,S
883,0,3,Dahlberg\t Miss. Gerda Ulrika,female,22.0,0,0,7552,10.5167,NaN,S
886,0,3,Rice\t Mrs. William (Margaret Norton),female,39.0,0,5,382652,29.1250,NaN,Q
889,0,3,"Johnston\t Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [101]:
pierwsza_klasa = df['Pclass'] == 1
kobiety = df['Sex'] == 'female'
notsurvived = df['Survived'] == 0

df[(~pierwsza_klasa) & kobiety & notsurvived]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
15,0,3,Vestrom\t Miss. Hulda Amanda Adolfina,female,14.0,0,0,350406,7.8542,NaN,S
19,0,3,Vander Planke\t Mrs. Julius (Emelia Maria Vand...,female,31.0,1,0,345763,18.0000,NaN,S
25,0,3,Palsson\t Miss. Torborg Danira,female,8.0,3,1,349909,21.0750,NaN,S
39,0,3,Vander Planke\t Miss. Augusta Maria,female,18.0,2,0,345764,18.0000,NaN,S
41,0,3,Ahlin\t Mrs. Johan (Johanna Persdotter Larsson),female,40.0,1,0,7546,9.4750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
855,0,2,Carter\t Mrs. Ernest Courtenay (Lilian Hughes),female,44.0,1,0,244252,26.0000,NaN,S
864,0,3,"Sage\t Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
883,0,3,Dahlberg\t Miss. Gerda Ulrika,female,22.0,0,0,7552,10.5167,NaN,S
886,0,3,Rice\t Mrs. William (Margaret Norton),female,39.0,0,5,382652,29.1250,NaN,Q
889,0,3,"Johnston\t Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [103]:
df[df['Age'] < 10]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
8,0,3,Palsson\t Master. Gosta Leonard,male,2.00,3,1,349909,21.0750,NaN,S
11,1,3,Sandstrom\t Miss. Marguerite Rut,female,4.00,1,1,PP 9549,16.7000,G6,S
17,0,3,Rice\t Master. Eugene,male,2.00,4,1,382652,29.1250,NaN,Q
25,0,3,Palsson\t Miss. Torborg Danira,female,8.00,3,1,349909,21.0750,NaN,S
44,1,2,Laroche\t Miss. Simonne Marie Anne Andree,female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
828,1,2,Mallet\t Master. Andre,male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
832,1,2,Richards\t Master. George Sibley,male,0.83,1,1,29106,18.7500,NaN,S
851,0,3,Andersson\t Master. Sigvard Harald Elias,male,4.00,4,2,347082,31.2750,NaN,S
853,0,3,Boulos\t Miss. Nourelain,female,9.00,1,1,2678,15.2458,NaN,C
870,1,3,Johnson\t Master. Harold Theodor,male,4.00,1,1,347742,11.1333,NaN,S

In [104]:

df[df['SibSp'] > df['Parch']]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,Braund\t Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
8,0,3,Palsson\t Master. Gosta Leonard,male,2.0,3,1,349909,21.0750,NaN,S
10,1,2,Nasser\t Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
861,0,3,Hansen\t Mr. Claus Peter,male,41.0,2,0,350026,14.1083,NaN,S
862,0,2,Giles\t Mr. Frederick Edward,male,21.0,1,0,28134,11.5000,NaN,S
864,0,3,"Sage\t Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
867,1,2,Duran y More\t Miss. Asuncion,female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
875,1,2,Abelson\t Mrs. Samuel (Hannah Wizosky),female,28.0,1,0,P/PP 3381,24.0000,NaN,C

#### `pd.DataFrame.query`

Innym sposobem na filtrowanie danych jest metoda `query`, która jako argument przyjmuje wyrażenie:

In [105]:
df.query('Pclass == 1').head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
7,0,1,McCarthy\t Mr. Timothy J,male,54.0,0,0,17463,51.8625,E46,S
12,1,1,Bonnell\t Miss. Elizabeth,female,58.0,0,0,113783,26.5500,C103,S
24,1,1,Sloper\t Mr. William Thompson,male,28.0,0,0,113788,35.5000,A6,S

In [106]:
df.query('(Pclass == 1) and (Sex == "female")').head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
12,1,1,Bonnell\t Miss. Elizabeth,female,58.0,0,0,113783,26.5500,C103,S
32,1,1,Spencer\t Mrs. William Augustus (Marie Eugenie),female,NaN,1,0,PC 17569,146.5208,B78,C
53,1,1,Harper\t Mrs. Henry Sleeper (Myna Haxtun),female,49.0,1,0,PC 17572,76.7292,D33,C

In [107]:
df.query('SibSp > Parch')

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,Braund\t Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
8,0,3,Palsson\t Master. Gosta Leonard,male,2.0,3,1,349909,21.0750,NaN,S
10,1,2,Nasser\t Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
861,0,3,Hansen\t Mr. Claus Peter,male,41.0,2,0,350026,14.1083,NaN,S
862,0,2,Giles\t Mr. Frederick Edward,male,21.0,1,0,28134,11.5000,NaN,S
864,0,3,"Sage\t Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
867,1,2,Duran y More\t Miss. Asuncion,female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
875,1,2,Abelson\t Mrs. Samuel (Hannah Wizosky),female,28.0,1,0,P/PP 3381,24.0000,NaN,C

In [108]:
young = 18
df.query('Age < @young').shape

(113, 11)

### Zadanie

#### Operacje na wierszach i kolumnach

In [109]:
df = pd.read_csv('./gapminder.csv', index_col='Country', nrows=5)

df

,female_BMI,male_BMI,gdp,population,under5mortality,life_expectancy,fertility
Country,,,,,,,
Afghanistan,21.07402,20.62058,1311.0,26528741.0,110.4,52.8,6.20
Albania,25.65726,26.44657,8644.0,2968026.0,17.9,76.8,1.76
Algeria,26.36841,24.59620,12314.0,34811059.0,29.5,75.5,2.73
Angola,23.48431,22.25083,7103.0,19842251.0,192.0,56.7,6.43
Antigua and Barbuda,27.50545,25.76602,25736.0,85350.0,10.9,75.5,2.16

Iterowanie po ramce danych oznacza oznacza przejście po nazwach kolumn:

In [110]:
for column_name in df:
    print(column_name)

female_BMI
male_BMI
gdp
population
under5mortality
life_expectancy
fertility

In [111]:
for col_name, series in df.items():
    print(col_name, series)
    break

female_BMI Country
Afghanistan            21.07402
Albania                25.65726
Algeria                26.36841
Angola                 23.48431
Antigua and Barbuda    27.50545
Name: female_BMI, dtype: float64

In [112]:
for idx, row in df.iterrows():
    print(idx, '\n', row)
    break

Afghanistan
 female_BMI         2.107402e+01
male_BMI           2.062058e+01
gdp                1.311000e+03
population         2.652874e+07
under5mortality    1.104000e+02
life_expectancy    5.280000e+01
fertility          6.200000e+00
Name: Afghanistan, dtype: float64

In [113]:
def bmi_level(bmi):
    if bmi <= 18.5:
        level =  'underweight'
    elif bmi < 25:
        level =  'normal'
    elif bmi < 30:
        level =  'overweight'
    else:
        level = 'obese'
    return level

s = df['male_BMI'].map(bmi_level)
    
s

Country
Afghanistan                normal
Albania                overweight
Algeria                    normal
Angola                     normal
Antigua and Barbuda    overweight
Name: male_BMI, dtype: object

In [114]:
def bmi_level(row_data):
    bmi = row_data['male_BMI']
    if bmi <= 18.5:
        return 'underweight'
    elif bmi < 25:
        return 'normal'
    elif bmi < 30:
        return 'overweight'
    return  'obese'

df.apply(bmi_level, axis=1)

Country
Afghanistan                normal
Albania                overweight
Algeria                    normal
Angola                     normal
Antigua and Barbuda    overweight
dtype: object

In [115]:
df.transpose()

Country,Afghanistan,Albania,Algeria,Angola,Antigua and Barbuda
female_BMI,2.107402e+01,2.565726e+01,2.636841e+01,2.348431e+01,27.50545
male_BMI,2.062058e+01,2.644657e+01,2.459620e+01,2.225083e+01,25.76602
gdp,1.311000e+03,8.644000e+03,1.231400e+04,7.103000e+03,25736.00000
population,2.652874e+07,2.968026e+06,3.481106e+07,1.984225e+07,85350.00000
under5mortality,1.104000e+02,1.790000e+01,2.950000e+01,1.920000e+02,10.90000
life_expectancy,5.280000e+01,7.680000e+01,7.550000e+01,5.670000e+01,75.50000
fertility,6.200000e+00,1.760000e+00,2.730000e+00,6.430000e+00,2.16000

### Zadanie

### Grupowanie (`groupby`)

Często zdarza się, gdy potrzebujemy podzielić dane ze względu na wartości w zadanej kolumnie, a następnie obliczenie zebranie danych w każdej z grup. Do tego służy metody `groupby`.

In [116]:
import pandas as pd

df = pd.read_csv('./nba.csv')

df.sample(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
191,Reggie Jackson,Detroit Pistons,1.0,PG,26.0,6-3,208.0,Boston College,13913044.0
306,Tony Parker,San Antonio Spurs,9.0,PG,34.0,6-2,185.0,NaN,13437500.0
348,Amar'e Stoudemire,Miami Heat,5.0,PF,33.0,6-10,245.0,NaN,947276.0
47,Isaiah Canaan,Philadelphia 76ers,0.0,PG,25.0,6-0,201.0,Murray State,947276.0
262,Mike Conley,Memphis Grizzlies,11.0,PG,28.0,6-1,175.0,Ohio State,9588426.0

_Przykład_: chcemy obliczyć średnią wypłatę dla każdej z drużyn.

In [117]:
df[['Team', 'Salary']].groupby('Team').mean().head()

                         Salary
Team
Atlanta Hawks      4.860197e+06
Boston Celtics     4.181505e+06
Brooklyn Nets      3.501898e+06
Charlotte Hornets  5.222728e+06
Chicago Bulls      5.785559e+06

Możemy też podać listę nazw kolumn. Wtedy wartości zostaną obliczone dla każdej z wytworzonych grup:

In [118]:
df.groupby(['Team', 'Position'])['Salary'].mean()

Team                Position
Atlanta Hawks       C           7.585417e+06
                    PF          5.988067e+06
                    PG          4.881700e+06
                    SF          3.000000e+06
                    SG          2.607758e+06
                                    ...
Washington Wizards  C           8.163476e+06
                    PF          5.650000e+06
                    PG          9.011208e+06
                    SF          2.789700e+06
                    SG          2.839248e+06
Name: Salary, Length: 149, dtype: float64

 * `sum()`
 * `min()`
 * `max()`
 * `mean()`
 * `size()`
 * `describe()`
 * `first()`
 * `last()`
 * `count()`
 * `std()`
 * `var()`
 * `sem()`

In [119]:
df[['Position', 'Salary']].groupby('Position').agg(['mean', 'std', 'count'])

                Salary
                  mean           std count
Position
C         5.967052e+06  5.787989e+06    78
PF        4.562483e+06  4.800054e+06    97
PG        5.077829e+06  5.051809e+06    88
SF        4.857393e+06  6.011889e+06    84
SG        4.009861e+06  4.491609e+06    99

In [120]:
def group_range(x):
    return x.max() - x.min()

df[['Position', 'Salary']].groupby('Position').apply(group_range)

              Salary
Position
C         22275967.0
PF        22081286.0
PG        21412973.0
SF        24969112.0
SG        19944278.0

In [121]:
gb = df.groupby(['Position'])

print('Liczba grup:', gb.ngroups)
print(gb.groups.keys())

print(gb.get_group('C').head())

Liczba grup: 5
dict_keys(['C', 'PF', 'PG', 'SF', 'SG'])
               Name            Team  Number Position   Age Height  Weight  \
7      Kelly Olynyk  Boston Celtics    41.0        C  25.0    7-0   238.0
10  Jared Sullinger  Boston Celtics     7.0        C  24.0    6-9   260.0
14     Tyler Zeller  Boston Celtics    44.0        C  26.0    7-0   253.0
23      Brook Lopez   Brooklyn Nets    11.0        C  28.0    7-0   275.0
27       Henry Sims   Brooklyn Nets    14.0        C  26.0   6-10   248.0

           College      Salary
7          Gonzaga   2165160.0
10      Ohio State   2569260.0
14  North Carolina   2616975.0
23        Stanford  19689000.0
27      Georgetown    947276.0

In [125]:
df.Height.str.split('-').str[0].astype('Int64') * 2.56

0      15.36
1      15.36
2      15.36
3      15.36
4      15.36
       ...
453    15.36
454    15.36
455    17.92
456    17.92
457     <NA>
Name: Height, Length: 458, dtype: Float64

### Pivot
Metoda `pivot` pozwala na stworzenie nowej ramki danych, gdzie indeks i nazwy kolumn są wartościami początkowej ranki danych. 

_Przykład_: zobaczmy na poniższą ramkę danych, która zawiera informacje o jakości tłumaczenia dla pary językowej hausa-angielski. Kolumna `system` zawiera nazwę systemu, kolumna `metric` - nazwę metryki, zaś kolumna `score`- wartość metryki. Chcemy przedstawić te dane w następujący sposób: jako klucz chcemy mieć nazwę systemu, zaś jako kolumny -  metryki. Możemy wykorzystać do tego metodę `pivot`, gdzie musimy podać 3 argumenty:
 * `index`: nazwę kolumny, na podstawie której zostanie stworzony indeks;
 * `columns`: nazwa kolumny, które zawiera nazwy kolumn dla nowej ramki danych;
 * `values`: nazwa kolumny, która zawiera interesujące nas dane.

In [128]:
df = pd.read_csv('https://raw.githubusercontent.com/wmt-conference/wmt21-news-systems/main/scores/automatic-scores.tsv', sep='\t')
df = df[df.pair == 'ha-en']
df.sample(10)

       pair       system    id  is_constrained    metric      score
1235  ha-en     Online-B  1356           False  chrf-all  46.658216
1229  ha-en          AMU   628            True    chrf-A  41.256570
1224  ha-en    TRANSSION   336           False    bleu-A  18.834851
1253  ha-en     Online-Y  1374           False    chrf-A  44.842874
1223  ha-en    TRANSSION   336           False  chrf-all  47.238279
1231  ha-en         P3AI   715            True  chrf-all  46.307402
1219  ha-en  Facebook-AI   181           False  chrf-all  48.653770
1261  ha-en      MS-EgDC   896            True    chrf-A  45.266274
1227  ha-en          AMU   628            True  chrf-all  41.256570
1221  ha-en  Facebook-AI   181           False    chrf-A  48.653770

In [129]:
df.pivot(index='system', columns='metric', values='score')

metric          bleu-A   bleu-all     chrf-A   chrf-all
system
AMU          14.132845  14.132845  41.256570  41.256570
Facebook-AI  20.982704  20.982704  48.653770  48.653770
GTCOM        17.794272  17.794272  46.714831  46.714831
HuaweiTSC    17.492440  17.492440  46.795737  46.795737
MS-EgDC      17.133350  17.133350  45.266274  45.266274
Manifold     16.943915  16.943915  45.638356  45.638356
NiuTrans     16.512243  16.512243  44.724766  44.724766
Online-B     18.655658  18.655658  46.658216  46.658216
Online-Y     13.898531  13.898531  44.842874  44.842874
P3AI         17.793617  17.793617  46.307402  46.307402
TRANSSION    18.834851  18.834851  47.238279  47.238279
TWB          12.326443  12.326443  40.282629  40.282629
UEdin        14.887836  14.887836  42.247415  42.247415
ZMT          18.837023  18.837023  47.231474  47.231474

### Zadanie

## Dane tekstowe

`pandas` posiada udogodnienia do pracy z wartościami tekstowymi:
 * dostęp następuje przez atrybut `str`;
 * funkcje:
    * formatujące: `lower()`, `upper()`;
    * wyrażenia regularne: `contains()`, `match()`;
    * inne: `split()`

In [130]:
df = pd.read_csv('./titanic_train.tsv', sep='\t', index_col='PassengerId')

df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,Braund\t Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,Cumings\t Mrs. John Bradley (Florence Briggs T...,female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,Heikkinen\t Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,Futrelle\t Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
5,0,3,Allen\t Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [131]:
df.Name.str.upper()

PassengerId
1                               BRAUND\t MR. OWEN HARRIS
2      CUMINGS\t MRS. JOHN BRADLEY (FLORENCE BRIGGS T...
3                                HEIKKINEN\t MISS. LAINA
4          FUTRELLE\t MRS. JACQUES HEATH (LILY MAY PEEL)
5                              ALLEN\t MR. WILLIAM HENRY
                             ...
887                               MONTVILA\t REV. JUOZAS
888                        GRAHAM\t MISS. MARGARET EDITH
889            JOHNSTON\t MISS. CATHERINE HELEN "CARRIE"
890                               BEHR\t MR. KARL HOWELL
891                                 DOOLEY\t MR. PATRICK
Name: Name, Length: 891, dtype: object

In [132]:
print(df.Name.head())
df.Name.str.contains('Miss|Mrs').head()

PassengerId
1                             Braund\t Mr. Owen Harris
2    Cumings\t Mrs. John Bradley (Florence Briggs T...
3                              Heikkinen\t Miss. Laina
4        Futrelle\t Mrs. Jacques Heath (Lily May Peel)
5                            Allen\t Mr. William Henry
Name: Name, dtype: object

PassengerId
1    False
2     True
3     True
4     True
5    False
Name: Name, dtype: bool

In [133]:
df.Name.str.split('\t', expand=True)

                     0                                            1
PassengerId
1               Braund                              Mr. Owen Harris
2              Cumings   Mrs. John Bradley (Florence Briggs Thayer)
3            Heikkinen                                  Miss. Laina
4             Futrelle           Mrs. Jacques Heath (Lily May Peel)
5                Allen                            Mr. William Henry
...                ...                                          ...
887           Montvila                                  Rev. Juozas
888             Graham                         Miss. Margaret Edith
889           Johnston               Miss. Catherine Helen "Carrie"
890               Behr                              Mr. Karl Howell
891             Dooley                                  Mr. Patrick

[891 rows x 2 columns]

In [134]:
df.Name.str.split('\t')

PassengerId
1                             [Braund,  Mr. Owen Harris]
2      [Cumings,  Mrs. John Bradley (Florence Briggs ...
3                              [Heikkinen,  Miss. Laina]
4        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
5                            [Allen,  Mr. William Henry]
                             ...
887                             [Montvila,  Rev. Juozas]
888                      [Graham,  Miss. Margaret Edith]
889          [Johnston,  Miss. Catherine Helen "Carrie"]
890                             [Behr,  Mr. Karl Howell]
891                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [136]:
df.Name.str.split('\t').str[0]

PassengerId
1         Braund
2        Cumings
3      Heikkinen
4       Futrelle
5          Allen
         ...
887     Montvila
888       Graham
889     Johnston
890         Behr
891       Dooley
Name: Name, Length: 891, dtype: object

In [137]:
df.Name.str.split('\t').str[1].str.strip().str.split(' ').str[0]

PassengerId
1        Mr.
2       Mrs.
3      Miss.
4       Mrs.
5        Mr.
       ...
887     Rev.
888    Miss.
889    Miss.
890      Mr.
891      Mr.
Name: Name, Length: 891, dtype: object

### Zadanie
Zestaw `nba.csv` zawiera informaję o wysokości zawodników. Oblicz wzrost każdego z zawodników w systemie metrycznym przyjmując, że stop to `30.48` cm., a cal to `2.54` cm.

In [140]:
df = pd.read_csv('nba.csv')
df.sample(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
102,Pablo Prigioni,Los Angeles Clippers,9.0,PG,39.0,6-3,185.0,NaN,947726.0
178,J.R. Smith,Cleveland Cavaliers,5.0,SG,30.0,6-6,225.0,NaN,5000000.0
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
337,Marvin Williams,Charlotte Hornets,2.0,PF,29.0,6-9,237.0,North Carolina,7000000.0
168,Kyrie Irving,Cleveland Cavaliers,2.0,PG,24.0,6-3,193.0,Duke,16407501.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
95,Jeff Green,Los Angeles Clippers,8.0,SF,29.0,6-9,235.0,Georgetown,9650000.0
27,Henry Sims,Brooklyn Nets,14.0,C,26.0,6-10,248.0,Georgetown,947276.0
371,Jarell Eddie,Washington Wizards,8.0,SG,24.0,6-7,218.0,Virginia Tech,561716.0
357,Mario Hezonja,Orlando Magic,23.0,SG,21.0,6-8,218.0,NaN,3741480.0

In [147]:
# Replace '-' with '.'; change type to float, multiply by 0.3048m/f; 
round((df.Height.str.replace('-','.').astype(float))*0.3048,2)

0      1.89
1      2.01
2      1.98
3      1.98
4      1.86
       ...
453    1.92
454    1.86
455    2.23
456    2.13
457     NaN
Name: Height, Length: 458, dtype: float64